# 중복제거 & 중복값 찾기

두 개의 데이터가 있다. 이 중 겹치는 것을 제외한 데이터(only 1 & only 2)와 겹치는 값만 있는 데이터(중복)를 뽑아내야 한다.

In [1]:
import pandas as pd

데이터 불러오기

In [2]:
file_1 = pd.read_excel('파일.xlsx', sheet_name = '1차')[['kl_pk', 'kl_name']]
file_2 = pd.read_excel('파일.xlsx', sheet_name = '2차')[['kl_pk', 'kl_name']]

데이터 예시

In [3]:
file_1.sample(3)

     kl_pk            kl_name
218  23270  intolerable voice
447  26407  overly theatrical
322  24625      poorly staged

In [4]:
file_2.sample(3)

     kl_pk             kl_name
248  22562           ludicrous
33    1075  atrocious dialogue
243  22035               lousy

### 겹치는거 제거하기

In [55]:
only1 = file_1[~file_1['kl_pk'].isin(file_2['kl_pk'])]
only2 = file_2[~file_2['kl_pk'].isin(file_1['kl_pk'])]

### 중복값 찾기

In [60]:
# file1에서 file2와 겹치는 값 찾기 
rere = file_1[file_1['kl_pk'].isin(file_2['kl_pk'])]

# file2에서 file1과 겹치는 값 찾기 
rere2 = file_2[file_2['kl_pk'].isin(file_1['kl_pk'])]

In [61]:
# 중복값 합치기
rere = pd.concat([rere, rere2], axis = 0)

In [62]:
# 고유값으로 만들기
rere = rere.drop_duplicates('kl_pk')

내보내기

In [63]:
rere.to_excel('rere.xlsx')